nguyentri/nuttx/boards/arm/ra8/fpb-ra8e1/src/ra8e1_pwm_escs.c
/****************************************************************************
 * boards/arm/ra8/fpb-ra8e1/src/ra8e1_pwm_escs.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/
#ifdef CONFIG_RA8E1_PWM_ESCS_EXAMPLE

#include <nuttx/config.h>

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <fcntl.h>
#include <unistd.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/timers/pwm.h>
#include <nuttx/ioexpander/gpio.h>
#include <arch/board/board.h>

#include "arm_internal.h"
#include "chip.h"
#include "ra_gpio.h"
#include "ra_gpt.h"
#include "ra8e1_log.h"
#include "fpb-ra8e1.h"


#ifdef CONFIG_RA8E1_PWM_ESCS

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* ESC PWM Channel Definitions - Using 4 ESCs only for simplicity */

#define NUM_ESC_CHANNELS        4
#define ESC_PWM_FREQUENCY       400      /* 400Hz for ESC control */
#define ESC_PWM_MIN_US          1000     /* Minimum pulse width (microseconds) */
#define ESC_PWM_MAX_US          2000     /* Maximum pulse width (microseconds) */
#define ESC_PWM_ARM_US          1000     /* Arming pulse width */

/* PWM Device Paths */

#define PWM_DEVICE_PATH         "/dev/pwm"

/* RTT Command Buffer */
#define RTT_COMMAND_MAX         64

/* GPIO Configuration for ESC PWM pins */

static gpio_pinset_t g_pwm_esc1 = {3, 0, 0};   /* P300 - GPT3A */
static gpio_pinset_t g_pwm_esc2 = {4, 15, 0};  /* P415 - GPT0A */
static gpio_pinset_t g_pwm_esc3 = {1, 14, 0};  /* P114 - GPT2B */
static gpio_pinset_t g_pwm_esc4 = {3, 2, 0};   /* P302 - GPT4A */

/* ESC Status Structure */

struct esc_status_s
{
  bool armed;                   /* ESC armed status */
  uint16_t throttle_percent;    /* Current throttle percentage */
  uint32_t pulse_width_us;      /* Current pulse width in microseconds */
};

/* ESC Channel Configuration */

struct esc_channel_s
{
  int pwm_channel;              /* PWM channel number */
  const char *device_path;      /* PWM device path */
  int fd;                       /* File descriptor */
  uint16_t current_throttle;    /* Current throttle percentage */
  bool armed;                   /* ESC armed status */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* PWM device descriptors for ESC channels */

static struct pwm_lowerhalf_s *g_pwm_esc_devs[4];

/* Demo control variables */

static bool g_running = false;
static char g_rtt_command[RTT_COMMAND_MAX];

/* ESC channel configurations */

static struct esc_channel_s g_esc_channels[NUM_ESC_CHANNELS] =
{
  { 3, "/dev/pwm3", -1, 0, false },  /* ESC1 - P300, GPT3A */
  { 0, "/dev/pwm0", -1, 0, false },  /* ESC2 - P415, GPT0A */
  { 2, "/dev/pwm2", -1, 0, false },  /* ESC3 - P114, GPT2B */
  { 4, "/dev/pwm4", -1, 0, false },  /* ESC4 - P302, GPT4A */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int ra8e1_pwm_setup_pins(void);
static int ra8e1_pwm_initialize(void);
static int ra8e1_pwm_setup(void);
static struct pwm_lowerhalf_s *ra8e1_esc_get_pwm_dev(int esc_index);
static int ra8e1_esc_set_duty_us(int esc_index, uint32_t pulse_us, uint32_t frequency);
static int ra8e1_esc_stop_all(void);

static int esc_pwm_open(int esc_index);
static int esc_pwm_close(int esc_index);
static int esc_set_throttle_us(int esc_index, uint32_t pulse_us);
static int esc_set_throttle_percent(int esc_index, uint16_t throttle_percent);
static int esc_arm(int esc_index);
static int esc_disarm(int esc_index);
static int esc_arm_all(void);
static int esc_disarm_all(void);

static void print_menu(void);
static void process_rtt_command(const char *command);
static int parse_esc_command(const char *command, int *esc_index, int *value);

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: ra8e1_pwm_setup_pins
 *
 * Description:
 *   Setup GPIO pins for PWM ESC output
 *
 ****************************************************************************/

static int ra8e1_pwm_setup_pins(void)
{
  /* Configure ESC1 pin (P300 - GPT3A) */
  ra_configgpio(g_pwm_esc1);

  /* Configure ESC2 pin (P415 - GPT0A) */
  ra_configgpio(g_pwm_esc2);

  /* Configure ESC3 pin (P114 - GPT2B) */
  ra_configgpio(g_pwm_esc3);

  /* Configure ESC4 pin (P302 - GPT4A) */
  ra_configgpio(g_pwm_esc4);

  pwminfo("ESC PWM pins configured successfully\n");
  return 0;
}

/****************************************************************************
 * Name: ra8e1_pwm_initialize
 *
 * Description:
 *   Initialize PWM for ESC control and register the PWM devices.
 *
 * Returned Value:
 *   Zero is returned on success.  Otherwise, a negated errno value is
 *   returned to indicate the nature of the failure.
 *
 ****************************************************************************/

